#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/frango-finastra/review-ex/runs/run-unMSXNkzshe8LVia

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
azurerm_resource_group.k8s: Refreshing state... [id=/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg]
module.networks.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01]
module.networks.azurerm_subnet.this["node_pool_1"]: Refreshing state... [id=/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01/subnets/node_pool_1sn01]
module.networks.azurerm_subnet.this["agic"]: Refreshing state... [id=/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01/subnets/agicsn01]
module.networks.azurerm_subnet.this["lb"]: Refreshing state... [id=/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01/subnets/lbsn01]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_resource_group.k8s has been changed
  ~ resource "azurerm_resource_group" "k8s" {
        id       = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg"
        name     = "newatcherrg"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }
  # module.networks.azurerm_subnet.this["agic"] has been changed
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01/subnets/agicsn01"
        name                                           = "agicsn01"
      + service_endpoint_policy_ids                    = []
      + service_endpoints                              = []
        # (6 unchanged attributes hidden)
    }
  # module.networks.azurerm_subnet.this["lb"] has been changed
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01/subnets/lbsn01"
        name                                           = "lbsn01"
      + service_endpoint_policy_ids                    = []
      + service_endpoints                              = []
        # (6 unchanged attributes hidden)
    }
  # module.networks.azurerm_subnet.this["node_pool_1"] has been changed
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01/subnets/node_pool_1sn01"
        name                                           = "node_pool_1sn01"
      + service_endpoint_policy_ids                    = []
      + service_endpoints                              = []
        # (6 unchanged attributes hidden)
    }
  # module.networks.azurerm_virtual_network.this has been changed
  ~ resource "azurerm_virtual_network" "this" {
        id                      = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01"
        name                    = "northeurope-vnet01"
      ~ subnet                  = [
          + {
              + address_prefix = "10.32.224.0/25"
              + id             = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01/subnets/agicsn01"
              + name           = "agicsn01"
              + security_group = ""
            },
          + {
              + address_prefix = "10.32.224.128/25"
              + id             = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01/subnets/lbsn01"
              + name           = "lbsn01"
              + security_group = ""
            },
          + {
              + address_prefix = "172.16.0.0/19"
              + id             = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01/subnets/node_pool_1sn01"
              + name           = "node_pool_1sn01"
              + security_group = ""
            },
        ]
      + tags                    = {}
        # (7 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.k8s.azurerm_key_vault.agic_cert will be created
  + resource "azurerm_key_vault" "agic_cert" {
      + access_policy                   = [
          + {
              + application_id          = null
              + certificate_permissions = [
                  + "backup",
                  + "create",
                  + "delete",
                  + "deleteissuers",
                  + "get",
                  + "getissuers",
                  + "import",
                  + "list",
                  + "listissuers",
                  + "managecontacts",
                  + "manageissuers",
                  + "purge",
                  + "recover",
                  + "restore",
                  + "setissuers",
                  + "update",
                ]
              + key_permissions         = [
                  + "backup",
                  + "create",
                  + "decrypt",
                  + "delete",
                  + "encrypt",
                  + "get",
                  + "import",
                  + "list",
                  + "purge",
                  + "recover",
                  + "restore",
                  + "sign",
                  + "unwrapKey",
                  + "update",
                  + "verify",
                  + "wrapKey",
                ]
              + object_id               = "b1c6fef0-e502-4e45-b6dd-393037ed806e"
              + secret_permissions      = [
                  + "backup",
                  + "get",
                  + "set",
                  + "list",
                  + "delete",
                  + "recover",
                  + "restore",
                  + "purge",
                ]
              + storage_permissions     = [
                  + "backup",
                  + "delete",
                  + "deletesas",
                  + "get",
                  + "getsas",
                  + "set",
                  + "setsas",
                  + "list",
                  + "listsas",
                  + "update",
                  + "recover",
                  + "restore",
                  + "purge",
                  + "regeneratekey",
                ]
              + tenant_id               = "d7ceee62-243a-40c2-94d8-1d1187fc1fcf"
            },
        ]
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "northeurope"
      + name                            = "kv-cert-01"
      + purge_protection_enabled        = true
      + resource_group_name             = "newatcherrg"
      + sku_name                        = "standard"
      + soft_delete_enabled             = (known after apply)
      + soft_delete_retention_days      = 90
      + tenant_id                       = "d7ceee62-243a-40c2-94d8-1d1187fc1fcf"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.k8s.azurerm_key_vault.cluster will be created
  + resource "azurerm_key_vault" "cluster" {
      + access_policy                   = [
          + {
              + application_id          = null
              + certificate_permissions = [
                  + "backup",
                  + "create",
                  + "delete",
                  + "deleteissuers",
                  + "get",
                  + "getissuers",
                  + "import",
                  + "list",
                  + "listissuers",
                  + "managecontacts",
                  + "manageissuers",
                  + "purge",
                  + "recover",
                  + "restore",
                  + "setissuers",
                  + "update",
                ]
              + key_permissions         = [
                  + "backup",
                  + "create",
                  + "decrypt",
                  + "delete",
                  + "encrypt",
                  + "get",
                  + "import",
                  + "list",
                  + "purge",
                  + "recover",
                  + "restore",
                  + "sign",
                  + "unwrapKey",
                  + "update",
                  + "verify",
                  + "wrapKey",
                ]
              + object_id               = "b1c6fef0-e502-4e45-b6dd-393037ed806e"
              + secret_permissions      = [
                  + "backup",
                  + "get",
                  + "set",
                  + "list",
                  + "delete",
                  + "recover",
                  + "restore",
                  + "purge",
                ]
              + storage_permissions     = [
                  + "backup",
                  + "delete",
                  + "deletesas",
                  + "get",
                  + "getsas",
                  + "set",
                  + "setsas",
                  + "list",
                  + "listsas",
                  + "update",
                  + "recover",
                  + "restore",
                  + "purge",
                  + "regeneratekey",
                ]
              + tenant_id               = "d7ceee62-243a-40c2-94d8-1d1187fc1fcf"
            },
        ]
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "northeurope"
      + name                            = "kv-cluster-01"
      + resource_group_name             = "newatcherrg"
      + sku_name                        = "standard"
      + soft_delete_enabled             = (known after apply)
      + soft_delete_retention_days      = 90
      + tenant_id                       = "d7ceee62-243a-40c2-94d8-1d1187fc1fcf"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.k8s.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + dns_prefix                          = "aks-01"
      + fqdn                                = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (known after apply)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (known after apply)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "northeurope"
      + name                                = "aks-01"
      + node_resource_group                 = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + private_link_enabled                = (known after apply)
      + resource_group_name                 = "newatcherrg"
      + sku_tier                            = "Free"

      + addon_profile {
          + aci_connector_linux {
              + enabled = false
            }

          + azure_policy {
              + enabled = true
            }

          + http_application_routing {
              + enabled                            = false
              + http_application_routing_zone_name = (known after apply)
            }

          + kube_dashboard {
              + enabled = false
            }

          + oms_agent {
              + enabled                    = true
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = false
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = "600"
          + max_node_provisioning_time       = "15m"
          + max_unready_nodes                = 3
          + max_unready_percentage           = 45
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = "10m"
          + scale_down_delay_after_delete    = "10s"
          + scale_down_delay_after_failure   = "3m"
          + scale_down_unneeded              = "10m"
          + scale_down_unready               = "20m"
          + scale_down_utilization_threshold = "0.5"
          + scan_interval                    = "10s"
          + skip_nodes_with_local_storage    = false
          + skip_nodes_with_system_pods      = true
        }

      + default_node_pool {
          + enable_auto_scaling    = true
          + enable_host_encryption = false
          + enable_node_public_ip  = false
          + kubelet_disk_type      = (known after apply)
          + max_count              = 2
          + max_pods               = (known after apply)
          + min_count              = 1
          + name                   = "default"
          + node_count             = (known after apply)
          + node_labels            = (known after apply)
          + orchestrator_version   = (known after apply)
          + os_disk_size_gb        = (known after apply)
          + os_disk_type           = "Managed"
          + os_sku                 = (known after apply)
          + type                   = "VirtualMachineScaleSets"
          + ultra_ssd_enabled      = false
          + vm_size                = "Standard_D2s_v3"
          + vnet_subnet_id         = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01/subnets/node_pool_1sn01"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + linux_profile {
          + admin_username = "aksadmin"

          + ssh_key {
              + key_data = (known after apply)
            }
        }

      + network_profile {
          + dns_service_ip     = "192.168.0.10"
          + docker_bridge_cidr = "192.168.128.1/17"
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "calico"
          + outbound_type      = "userDefinedRouting"
          + pod_cidr           = (known after apply)
          + service_cidr       = "192.168.0.0/17"

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true

          + azure_active_directory {
              + managed   = true
              + tenant_id = "d7ceee62-243a-40c2-94d8-1d1187fc1fcf"
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # module.k8s.azurerm_log_analytics_workspace.loganalytics will be created
  + resource "azurerm_log_analytics_workspace" "loganalytics" {
      + daily_quota_gb             = -1
      + id                         = (known after apply)
      + internet_ingestion_enabled = true
      + internet_query_enabled     = true
      + location                   = "northeurope"
      + name                       = "law-01"
      + portal_url                 = (known after apply)
      + primary_shared_key         = (sensitive value)
      + resource_group_name        = "newatcherrg"
      + retention_in_days          = 7
      + secondary_shared_key       = (sensitive value)
      + sku                        = "Standard"
      + workspace_id               = (known after apply)
    }

  # module.k8s.azurerm_monitor_diagnostic_setting.logAnalytics_aks will be created
  + resource "azurerm_monitor_diagnostic_setting" "logAnalytics_aks" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "lan-01"
      + target_resource_id         = (known after apply)

      + log {
          + category = "cluster-autoscaler"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + log {
          + category = "guard"
          + enabled  = false

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "kube-apiserver"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + log {
          + category = "kube-audit"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + log {
          + category = "kube-audit-admin"
          + enabled  = false

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "kube-controller-manager"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + log {
          + category = "kube-scheduler"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
    }

  # module.k8s.azurerm_role_assignment.network will be created
  + resource "azurerm_role_assignment" "network" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg/providers/Microsoft.Network/virtualNetworks/northeurope-vnet01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.k8s.azurerm_role_assignment.podidentitycontroller will be created
  + resource "azurerm_role_assignment" "podidentitycontroller" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.k8s.azurerm_role_assignment.podidentitycontroller2 will be created
  + resource "azurerm_role_assignment" "podidentitycontroller2" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.k8s.azurerm_role_assignment.podidentitykubelet will be created
  + resource "azurerm_role_assignment" "podidentitykubelet" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.k8s.azurerm_role_assignment.podidentitykubelet2 will be created
  + resource "azurerm_role_assignment" "podidentitykubelet2" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.k8s.azurerm_role_assignment.podidentitykubeletcontributor will be created
  + resource "azurerm_role_assignment" "podidentitykubeletcontributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/subscriptions/6fd636cc-6846-4ecd-a29c-385dfbde54f9/resourceGroups/newatcherrg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.k8s.tls_private_key.linux will be created
  + resource "tls_private_key" "linux" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

Plan: 12 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @AndreasFrangopoulos, Action: `pull_request`*